Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་རབ་འབྱོར་མཚན་མ་མེད་པ་ཉིད་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུའོ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུའོ། །ཕྱིར་མི་འོང་བའི་འབྲས་བུའོ། །དགྲ་བཅོམ་པ་ཉིད་དོ། །རང་བྱང་ཆུབ་བོ། །བྱང་ཆུབ་སེམས་དཔའི་ཆོས་སོ། །སངས་རྒྱས་ཀྱི་ཆོས་སོ།
en: Well then, Subhūti,” the Blessed One asked further, “do the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, the attributes of the bodhisattvas, and the attributes of the buddhas constitute signlessness?” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལགས་སོ།
en: Yes, they do, Blessed Lord!

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་རྣམ་གྲངས་དེས་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པར་རིག་པར་བྱ་སྟེ།
en: Those, Subhūti,” continued the Blessed One, “are the formulations explaining how you should know that all phenomena are signlessness.

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་འདི་ལ་བསླབ་པའི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། དགེ་བའི་ཆོས་མང་པོས་རྣམ་པར་འཕེལ་ཏེ། འདི་ལྟ་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་།
en: Subhūti, bodhisattva great beings who train in this signlessness of all phenomena are enhanced by many virtuous attributes.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། དེ་མ་ཡིན་པའི་སངས་རྒྱས་ཀྱི་ཆོས་དཔག་ཏུ་མེད་པ་དག་གིས་རྣམ་པར་འཕེལ་ལོ།
en: That is to say, they are enhanced by the six perfections, the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the five extrasensory powers, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, and all the inestimable attributes of the buddhas apart from these. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་བསླབ་པར་བྱ་བ་མ་གཏོགས་པར་གཞན་ལ་བསླབ་པར་བྱ་བ་མེད་དོ།
en: If you ask why, it is because bodhisattva great beings should train in emptiness, signlessness, and wishlessness, but not train in anything except these.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྣམ་པར་ཐར་པའི་སྒོ་འདི་གསུམ་དུ་དགེ་བའི་ཆོས་ཐམས་ཅད་མ་འདུས་པ་མེད་དེ།
en: If you ask why, all virtuous attributes are gathered in these three gateways to liberation.

source: འདི་ལྟར་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ནི་སྟོང་པ་ཉིད་རྣམ་པར་ཐར་པའི་སྒོའོ།
en: Emptiness as a gateway to liberation implies that phenomena are empty of intrinsic defining characteristics.

source: །མཚན་མ་དང་བྲལ་བ་ནི་མཚན་མ་མེད་པ་རྣམ་པར་ཐར་པའི་སྒོའོ།
en: Signlessness as a gateway to liberation implies that they are without signs.

source: །མངོན་པར་འདུ་བྱ་བ་མེད་པ་ནི་སྨོན་པ་མེད་པ་རྣམ་པར་ཐར་པའི་སྒོ་སྟེ།
en: Wishlessness as a gateway to liberation implies that they are without conditioning.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་པོ་འདི་དག་ལ་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕུང་པོ་ལྔ་ལ་སློབ་པ་ཡིན།
en: Bodhisattva great beings who train in these three gateways to liberation do train in the five psycho-physical aggregates.

source: སྐྱེ་མཆེད་བཅུ་གཉིས་ལ་སློབ་པ་ཡིན།
en: They train in the twelve sense fields.

source: ཁམས་བཅྭོ་བརྒྱད་ལ་སློབ་པ་ཡིན།
en: They train in the eighteen sensory elements.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཡན་ལག་བཅུ་གཉིས་ལ་སློབ་པ་ཡིན།
en: They train in the twelve links of dependent origination.

source: ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སློབ་པ་ཡིན།
en: They train in the six perfections.

source: ནང་སྟོང་པ་ཉིད་ལ་སློབ་པ་ཡིན།
en: They train in the emptiness of internal phenomena.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སློབ་པ་ཡིན།
en: They train in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities. {Ki.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་སློབ་པ་ཡིན། ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: VIII: 80} They train in the four applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སློབ་པ་ཡིན།
en: They train in the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path.

source: འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ལ་སློབ་པ་ཡིན།
en: They train in the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, all the meditative stabilities, and all the dhāraṇī gateways.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སློབ་པ་ཡིན།
en: They train in the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སློབ་པ་ཡིན། རབ་འབྱོར་གྱིས་གསོལ་པ།
en: They train in [the goals], up to and including all-aspect omniscience.”

source: བཅོམ་ལྡན་འདས་རྣམ་པ་གང་གིས་ཚུལ་དུ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་སློབ་པ་ལགས།
en: Subhūti then asked, “Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, how do they train in that [aforementioned] manner in the five acquisitive aggregates?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་རབ་ཏུ་ཤེས་ཏེ།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they correctly discern physical forms.

source: གཟུགས་ཇི་ལྟར་སྐྱེ་བ་དང་། གཟུགས་ཇི་ལྟར་འགག་པ་དང་། གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བུ་ཡིན་པ་རབ་ཏུ་ཤེས་སོ། །དེ་ལ་ཇི་ལྟར་ན་གཟུགས་ཤེས་པ་ཡིན་ཞེ་ན། འདི་ལྟ་སྟེ་དཔེར་ན།
en: They correctly discern how physical forms arise, how physical forms cease, and what is the real nature of physical forms.

source: ལྦུ་བའི་ཕུང་པོ་སྙིང་པོ་མེད་པ་ལྟར་ཤིན་དུ་གསོང་ལྡོང་དང་། ཤིན་དུ་གསེ་ཚགས་དང་། ཤིན་དུ་སྙིང་པོ་མེད་པར་རབ་ཏུ་ཤེས་ཏེ། དེ་ལྟར་ན་གཟུགས་ཤེས་པ་ཡིན་ནོ།
en: If you ask how they discern physical forms, they discern physical forms just as they correctly discern an essenceless mass of foam to be utterly fallacious, utterly porous, and utterly essenceless. “

source: །ཇི་ལྟར་གཟུགས་ཀྱི་སྐྱེ་བ་དང་། འཇིག་པ་ཤེས་པ་ཡིན་ཞེ་ན། གཟུགས་ནི་གང་ནས་ཀྱང་འོངས་པ་མེད་ཅིང་གང་དུ་ཡང་འགྲོ་བ་མེད་པས། གང་ནས་ཀྱང་མི་འོང་གང་དུ་ཡང་མི་འགྲོ་བ་སྟེ། གང་གང་ནས་ཀྱང་མ་འོངས་པ་དེ་གང་དུ་ཡང་མ་སོང་བ་དེར་ཤེས་པ་སྟེ།
en: If you ask how they discern the arising and perishing of physical forms, inasmuch as physical forms have neither come from anywhere, nor gone anywhere, and will neither come from anywhere nor go anywhere, they discern that there is nothing at all from which they have come and nowhere at all that they go.

source: དེ་ལྟར་ན་གཟུགས་ཀྱི་སྐྱེ་བ་དང་འཇིག་པ་ཤེས་པ་ཡིན་ནོ།
en: It is in this way that they discern the arising and perishing of physical forms.

source: །ཇི་ལྟར་ན་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ཞེ་ན། གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ནི་མི་སྐྱེ། མི་འགག །འོང་བ་མེད། འགྲོ་བ་མེད། ཀུན་ནས་ཉོན་མོངས་པ་མ་ཡིན། རྣམ་པར་བྱང་བ་མ་ཡིན། འབྲི་བ་མ་ཡིན། འཕེལ་བ་མ་ཡིན་ཏེ།
en: If you ask how they discern the real nature of physical forms, it is the case that the real nature of physical forms neither arises nor ceases, neither comes nor goes, is neither afflicted nor purified, and is neither diminished nor enhanced.

source: ཕྱིན་ཅི་ལོག་མ་ཡིན་ཞིང་དེ་བཞིན་ཉིད་དུ་གནས་པ་སྟེ།
en: That is to say, phenomena dwell without error in the real nature.

source: དེའི་ཕྱིར་དེ་བཞིན་ཉིད་ཅེས་བྱའོ།
en: This is why it is termed the real nature.

source: །དེ་ལྟར་ན་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ནོ།
en: It is in this manner that they discern the real nature of physical forms. “

source: །ཇི་ལྟར་ན་ཚོར་བ་ཤེས་པ་ཡིན་ཞེ་ན། འདི་ལྟ་སྟེ་དཔེར་ན། ཆུའི་ཆུ་བུར་གསོག་ཏུ་འདུག་པ་སྐྱེ་ཞིང་འགག་པ་ལྟར་ཤེས་པ་སྟེ། དེ་ལྟར་ན་ཚོར་བ་ཤེས་པ་ཡིན་ནོ།
en: If you ask how they discern feelings, they discern feelings just as a vacuous bubble of water is discerned to arise and cease.

source: །ཇི་ལྟར་ན་ཚོར་བའི་སྐྱེ་བ་དང་། འཇིག་པ་ཤེས་པ་ཡིན་ཞེ་ན། ཚོར་བ་ནི་གང་ནས་ཀྱང་འོང་བ་མེད་ཅིང་གང་དུ་ཡང་འགྲོ་བ་མེད་པས། གང་ནས་ཀྱང་མི་འོང་གང་དུ་ཡང་མི་འགྲོ་བ་སྟེ། གང་གང་ནས་ཀྱང་མ་འོངས་པ་དེ་གང་དུ་ཡང་མ་སོང་བར་ཤེས་པ་སྟེ།
en: If you ask how they discern the arising and perishing of feelings, inasmuch as feelings have neither come from anywhere, nor gone anywhere, and will neither come from anywhere nor go anywhere, they discern that there is nothing at all from which they have come and nowhere at all that they go.

source: དེ་ལྟར་ན་ཚོར་བའི་སྐྱེ་བ་དང་འཇིག་པ་ཤེས་པ་ཡིན་ནོ།
en: It is in this way that they discern the arising and perishing of feelings.

source: །ཇི་ལྟར་ན་ཚོར་བའི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ཞེ་ན། ཚོར་བའི་དེ་བཞིན་ཉིད་ནི་མི་སྐྱེ། མི་འགག །འོང་བ་མེད། འགྲོ་བ་མེད། ཀུན་ནས་ཉོན་མོངས་པ་མ་ཡིན། རྣམ་པར་བྱང་བ་མ་ཡིན། འབྲི་བ་མ་ཡིན། འཕེལ་བ་མ་ཡིན་ཏེ།
en: If you ask how they discern the real nature of feelings, it is the case that the real nature of feelings neither arises nor ceases, neither comes nor goes, is neither afflicted nor purified, and is neither diminished nor enhanced.

source: ཕྱིན་ཅི་ལོག་མ་ཡིན་ཞིང་། དེ་བཞིན་ཉིད་དུ་གནས་པ་སྟེ།
en: That is to say, phenomena dwell without error in the real nature.

source: །དེ་ལྟར་ན་ཚོར་བའི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ནོ།
en: It is in this manner that they discern the real nature of feelings. “

source: །ཇི་ལྟར་ན་འདུ་ཤེས་ཤེས་པ་ཡིན་ཞེ་ན། འདི་ལྟ་སྟེ་དཔེར་ན། སྨིག་རྒྱུ་ལ་ཆུ་ཤིན་དུ་མི་དམིགས་པ་ལྟར་ཤེས་པ་སྟེ།
en: If you ask how they discern perceptions, they discern perceptions in the same way that the water in a mirage is known to be nonapprehensible.

source: དེ་ལྟར་ན་འདུ་ཤེས་ཤེས་པ་ཡིན་ནོ། །ཇི་ལྟར་ན་འདུ་ཤེས་ཀྱི་སྐྱེ་བ་དང་འཇིག་པ་ཤེས་པ་ཡིན་ཞེ་ན། འདུ་ཤེས་ནི་གང་ནས་ཀྱང་འོང་བ་མེད་ཅིང་གང་དུ་འགྲོ་བ་མེད་པས། གང་ནས་ཀྱང་མི་འོང་གང་དུ་ཡང་མི་འགྲོ་བ་སྟེ། གང་གང་ནས་ཀྱང་མ་འོངས་པ་དེ་གང་དུ་ཡང་མ་སོང་བར་ཤེས་པ་སྟེ།
en: If you ask how they discern the arising and perishing of perceptions, inasmuch as perceptions have neither come from anywhere, nor gone anywhere, and will neither come from anywhere nor go anywhere, they discern that there is nothing at all from which they have come and nowhere at all that they go.

source: དེ་ལྟར་ན་འདུ་ཤེས་ཀྱི་སྐྱེ་བ་དང་འཇིག་པ་ཤེས་པ་ཡིན་ནོ།
en: It is in this way that they discern the arising and perishing of perceptions. {Ki.

source: །ཇི་ལྟར་ན་འདུ་ཤེས་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ཞེ་ན། འདུ་ཤེས་ཀྱི་དེ་བཞིན་ཉིད་ནི་མི་སྐྱེ་མི་འགག །འོང་བ་མེད། འགྲོ་བ་མེད། ཀུན་ནས་ཉོན་མོངས་པ་མ་ཡིན། རྣམ་པར་བྱང་བ་མ་ཡིན། འབྲི་བ་མ་ཡིན། འཕེལ་བ་མ་ཡིན་ཏེ།
en: VIII: 81} If you ask how they discern the real nature of perceptions, it is the case that the real nature of perceptions neither arises nor ceases, neither comes nor goes, is neither afflicted nor purified, and is neither diminished nor enhanced.

source: དེ་ཕྱིན་ཅི་ལོག་མ་ཡིན་ཞིང་དེ་བཞིན་ཉིད་དུ་གནས་པ་སྟེ།
en: That is to say, phenomena dwell without error in the real nature.

source: །དེ་ལྟར་ན་འདུ་ཤེས་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ནོ།
en: It is in this manner that they discern the real nature of perceptions. “

source: །ཇི་ལྟར་ན་འདུ་བྱེད་ཤེས་པ་ཡིན་ཞེ་ན། འདི་ལྟ་སྟེ་དཔེར་ན། ཆུ་ཤིང་གི་ཤུན་པ་སོ་སོར་ཕྱེ་ན། སྙིང་པོ་ཤིན་དུ་མི་དམིགས་པ་དེ་ལྟར་ཤེས་པ་སྟེ།
en: If you ask how they discern formative predispositions, they discern formative predispositions in the same way that the core of a plantain tree is known to be absolutely nonapprehensible when the outer layers are peeled away.

source: དེ་ལྟར་ན་འདུ་བྱེད་ཤེས་པ་ཡིན་ནོ། །ཇི་ལྟར་ན་འདུ་བྱེད་ཀྱི་སྐྱེ་བ་དང་འཇིག་པ་ཤེས་པ་ཡིན་ཞེ་ན། འདུ་བྱེད་ནི་གང་ནས་ཀྱང་འོང་བ་མེད་ཅིང་གང་དུ་ཡང་འགྲོ་བ་མེད་པས། གང་ནས་ཀྱང་མི་འོང་གང་དུ་ཡང་མི་འགྲོ་བ་སྟེ། གང་གང་ནས་ཀྱང་མ་འོངས་པ་དེ་གང་དུ་ཡང་མ་སོང་བར་ཤེས་པ་སྟེ།
en: If you ask how they discern the arising and perishing of formative predispositions, inasmuch as formative predispositions have neither come from anywhere, nor gone anywhere, and will neither come from anywhere nor go anywhere, they discern that there is nothing at all from which they have come and nowhere at all that they go.

source: དེ་ལྟར་ན་འདུ་བྱེད་ཀྱི་སྐྱེ་བ་དང་། འཇིག་པ་ཤེས་པ་ཡིན་ནོ།
en: It is in this way that they discern the arising and perishing of formative predispositions.

source: །ཇི་ལྟར་ན་འདུ་བྱེད་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ཞེ་ན། འདུ་བྱེད་ཀྱི་དེ་བཞིན་ཉིད་ནི་མི་སྐྱེ། མི་འགག །འོང་བ་མེད། འགྲོ་བ་མེད། ཀུན་ནས་ཉོན་མོངས་པ་མ་ཡིན། རྣམ་པར་བྱང་བ་མ་ཡིན། འབྲི་བ་མ་ཡིན། འཕེལ་བ་མ་ཡིན་ཏེ།
en: If you ask how they discern the real nature of formative predispositions, it is the case that the real nature of formative predispositions neither arises nor ceases, neither comes nor goes, is neither afflicted nor purified, and is neither diminished nor enhanced.

source: ཕྱིན་ཅི་ལོག་མ་ཡིན་ཞིང་དེ་བཞིན་དུ་གནས་པ་སྟེ།
en: That is to say, phenomena dwell without error in the real nature.

source: །དེ་ལྟར་ན་འདུ་བྱེད་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ནོ།
en: It is in this manner that they discern the real nature of formative predispositions. “

source: །ཇི་ལྟར་ན་རྣམ་པར་ཤེས་པ་ཤེས་པ་ཡིན་ཞེ་ན། འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མ་བྱེད་པས་སྤྲུལ་པའི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་ལྟར་ཤེས་པ་སྟེ། དེ་ལྟར་ན་རྣམ་པར་ཤེས་པ་ཤེས་པ་ཡིན་ནོ།
en: If you ask how they discern consciousness, they discern consciousness in the same way that the four corps of an army conjured by an illusionist are discerned.

source: །ཇི་ལྟར་ན་རྣམ་པར་ཤེས་པའི་སྐྱེ་བ་དང་འཇིག་པ་ཤེས་པ་ཡིན་ཞེ་ན། རྣམ་པར་ཤེས་པ་ནི་གང་ནས་ཀྱང་འོང་བ་མེད་ཅིང་གང་དུ་ཡང་འགྲོ་བ་མེད་པས། གང་ནས་ཀྱང་མི་འོང་། གང་དུ་ཡང་མི་འགྲོ་གང་གང་ནས་ཀྱང་མ་འོངས་པ་དེ་གང་དུ་ཡང་མ་སོང་བར་ཤེས་པ་སྟེ།
en: If you ask how they discern the arising and perishing of consciousness, inasmuch as consciousness has neither come from anywhere, nor gone anywhere, and will neither come from anywhere nor go anywhere, they discern that there is nothing at all from which it has come and nowhere at all that it goes.

source: དེ་ནི་རྣམ་པར་ཤེས་པའི་སྐྱེ་བ་དང་འཇིག་པ་ཤེས་པ་ཡིན་ནོ།
en: It is in this way that they discern the arising and perishing of consciousness.

source: །ཇི་ལྟར་ན་རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ཞེ་ན། རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ནི་མི་སྐྱེ་མི་འགག་པ། འོང་བ་མེད། འགྲོ་བ་མེད། ཀུན་ནས་ཉོན་མོངས་པ་མ་ཡིན། རྣམ་པར་བྱང་བ་མ་ཡིན། འབྲི་བ་མ་ཡིན། འཕེལ་བ་མ་ཡིན་ཏེ།
en: If you ask how they discern the real nature of consciousness, it is the case that the real nature of consciousness neither arises nor ceases, neither comes nor goes, is neither afflicted nor purified, and is neither diminished nor enhanced.

source: ཕྱིན་ཅི་ལོག་མ་ཡིན་ཞིང་།
en: That is to say, phenomena dwell without error in the real nature.

source: དེ་བཞིན་དུ་གནས་པ་སྟེ། དེའི་ཕྱིར་དེ་བཞིན་ཉིད་ཅེས་བྱའོ།
en: This is why it is termed the real nature.

source: །དེ་ལྟར་ན་རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ནོ།
en: It is in this manner that they discern the real nature of consciousness. “

source: །ཇི་ལྟར་ན་སྐྱེ་མཆེད་རྣམས་ཤེས་པ་ཡིན་ཞེ་ན། ནང་གི་ཆོས་རྣམས་ནི་ནང་གི་ཆོས་རྣམས་ཀྱིས་སྟོང་། ཕྱིའི་ཆོས་རྣམས་ཀྱང་ཕྱིའི་ཆོས་རྣམས་ཀྱིས་སྟོང་པར་ཤེས་པ་སྟེ།
en: If you ask how they discern the sense fields, they discern internal phenomena to be empty of internal phenomena and they discern external phenomena to be empty of external phenomena.

source: དེ་ལྟར་ན་སྐྱེ་མཆེད་རྣམས་ཤེས་པ་ཡིན་ནོ།
en: It is in this manner that they discern the sense fields. “

source: །ཇི་ལྟར་ན་ཁམས་རྣམས་ཤེས་པ་ཡིན་ཞེ་ན། མིག་གི་ཁམས་ཀྱང་མིག་གི་ཁམས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་ངོ་། །གཟུགས་ཀྱི་ཁམས་ཀྱང་གཟུགས་ཀྱི་ཁམས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་ངོ་། །མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: If you ask how they discern the sensory elements, they discern that the sensory element of the eyes is empty of the essential nature of the sensory element of the eyes, that the sensory element of sights is empty of the essential nature of the sensory element of sights, and that the sensory element of visual consciousness is empty of the essential nature of the sensory element of visual consciousness. [

source: །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ཀྱི་ཁམས་ཀྱང་ཡིད་ཀྱི་ཁམས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་ངོ་། །ཆོས་ཀྱི་ཁམས་ཀྱང་ཆོས་ཀྱི་ཁམས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་ངོ་། །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཤེས་ཏེ། དེ་ལྟར་ན་ཁམས་རྣམས་ཤེས་པ་ཡིན་ནོ།
en: They discern that] the sensory elements of the ear, nose, tongue, body, and mental faculty are also empty of the essential nature of the sensory element of the mental faculty [and those other internal sensory elements]; that the [external sensory elements, up to and including] the sensory element of mental phenomena, are empty of the essential nature of the sensory element of mental phenomena [and those other external sensory elements]; and that [the sensory elements of consciousness, up to and including] the sensory element of mental consciousness, are empty of the essential nature of the sensory element of mental consciousness [and those other sensory elements of consciousness].

source: །ཇི་ལྟར་ན་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཤེས་པ་ཡིན་ཞེ་ན།
en: It is in this manner that they discern the sensory elements. {

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྐྱེ་བ་མེད་པར་ཤེས་པ་དང་།
en: Ki.

source: དེ་བཞིན་དུ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་འགག་པ་མེད་པ་དང་། ཆད་པ་མེད་པ་དང་། རྟག་པ་མེད་པ་དང་། དོན་གཅིག་པ་མ་ཡིན་པ་དང་། དོན་ཐ་དད་པ་མ་ཡིན་པ་དང་། འོང་བ་མེད་པ་དང་།
en: VIII: 82} “If you ask how they discern the links of dependent origination, they discern that the links of dependent origination do not arise, and they similarly discern that the links of dependent origination do not cease; that they are neither extinguished nor permanent; that they are neither confined to a single meaning, nor are their meanings manifold; that they neither come nor go; and that they are free from conceptual elaboration, and at peace.

source: འགྲོ་བ་མེད་པ་དང་། སྤྲོས་པ་དང་བྲལ་ཞིང་ཞི་བར་ཤེས་པ་དེ་ལྟར་ན། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཤེས་པ་ཡིན་ནོ།
en: It is in this manner that they discern the links of dependent origination. “

source: །ཇི་ལྟར་ན་འཕགས་པའི་བདེན་པ་རྣམས་ཤེས་པ་ཡིན་ཞེ་ན། སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་ཤེས་པ་ཡིན། ཀུན་འབྱུང་བ་དང་འགོག་པ་དང་། འགོག་པར་འགྲོ་བའི་ལམ་འཕགས་པའི་བདེན་པ་ཤེས་པ་ཡིན་ཏེ།
en: If you ask how they discern the truths of the noble ones, they discern the noble truth of suffering, and they discern the truths of the noble ones of the origin of suffering, the cessation of suffering, and the path that leads to cessation.

source: ཇི་ལྟར་ན་སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་ཤེས་པ་ཡིན་ཞེ་ན། སྡུག་བསྔལ་ཤེས་པ་ཡིན། བདེན་པ་ཤེས་པ་ཡིན། འཕགས་པའི་བདེན་པ་ཤེས་པ་ཡིན།
en: If you ask how they discern the truth of suffering, they discern suffering, they discern the truth, and they discern the truth of the noble ones.

source: གཉིས་ལས་རྣམ་པར་གྲོལ་བ་འཕགས་པའི་བདེན་པ་སྟེ། གཉིས་སུ་མེད་པ་ནི་འཕགས་པའི་བདེན་པ་ཞེས་བྱ་བར་ཤེས་པ་ཡིན་ནོ།
en: They discern the noble truth that is liberated from duality—that is to say, the truth of the noble ones is nondualistic.

source: །དེ་བཞིན་དུ་ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། འགོག་པར་འགྲོ་བའི་ལམ་འཕགས་པའི་བདེན་པ་ཤེས་པ་ཡིན་ཏེ།
en: Similarly, they discern the truths of the noble ones of the origin of suffering, the cessation of suffering, and the path that leads to cessation.

source: དེ་ལྟར་ན་འཕགས་པའི་བདེན་པ་རྣམས་ཤེས་པ་ཡིན་ནོ།
en: It is in this manner that they discern the truths of the noble ones.

source: །ཇི་ལྟར་ན་སྡུག་བསྔལ་གྱི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ཞེ་ན།
en: If you ask how they discern the real nature of the truths of the noble ones, they discern that the real nature of suffering is unerring.

source: སྡུག་བསྔལ་གྱི་དེ་བཞིན་ཉིད་ནི་མ་ནོར་བ་ཞེས་བྱ་བར་ཤེས་པ་ཡིན། དེ་བཞིན་དུ་ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་ལམ་གྱི་དེ་བཞིན་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་པ་ཡིན།
en: Similarly, they also correctly discern the real nature of the origin of suffering, the cessation of suffering, and the path that leads to cessation.

source: དེ་ལྟར་ན་འཕགས་པའི་བདེན་པ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་ཤེས་པ་ཡིན་ནོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: It is in this manner that they discern the real nature of the truths of the noble ones.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཕན་ཚུན་ཐ་དད་པའི་ཆོས་དེ་དག་དེ་ལྟར་འཚལ་ན། དེས་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་དཀྲུགས་པར་མི་འགྱུར་རམ།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, if they were to investigate phenomena that are so different from one another in this manner, would the realm of phenomena not be disrupted?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གལ་ཏེ་ཆོས་ཀྱི་དབྱིངས་སུ་མ་གཏོགས་པའི་ཆོས་ལ་ལ་ཞིག་ཡོད་ན་ནི། རྣམ་པར་དཀྲུགས་པར་ཡང་འགྱུར་ཏེ། རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་སུ་མ་གཏོགས་པའི་ཆོས་གཞན་གང་ཡང་མི་དམིགས་སོ།
en: Subhūti,” replied the Blessed One, “the realm of phenomena would be disrupted if there were any extraneous phenomena existing apart from it, but, Subhūti, nothing at all is apprehended apart from the realm of phenomena.

source: །གལ་ཏེ་དམིགས་ན་ནི་ཆོས་ཀྱི་དབྱིངས་ཀྱང་རྣམ་པར་འཁྲུག་པར་འགྱུར་རོ།
en: If any such thing were apprehended, the realm of phenomena would indeed be disrupted.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་འམ། བྱང་ཆུབ་སེམས་དཔའ་འམ། རང་སངས་རྒྱས་སམ། དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་ཀྱི་ཆོས་ཀྱི་དབྱིངས་སུ་མ་གཏོགས་པའི་ཆོས་གང་ཡང་མ་དམིགས་སོ།
en: If you ask why, Subhūti, it is because there is nothing that the tathāgatas, bodhisattvas, pratyekabuddhas, and the śrāvakas of the tathāgatas apprehend outside the realm of phenomena.

source: །དེ་ལྟར་མ་དམིགས་པས་ཆོས་ཀྱི་དབྱིངས་སུ་མ་གཏོགས་པའི་ཆོས་གཞན་ནོ་ཞེས་བྱ་བར་བརྟགས་པ་མེད་དོ།
en: Since there is nothing to apprehend, there is nothing conceived that is outside the realm of phenomena.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས་ཆོས་ཀྱི་དབྱིངས་ལ་བསླབ་པར་བྱའོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: It is in this manner, Subhūti, that bodhisattva great beings who practice the perfection of wisdom should train in the realm of phenomena.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་དབྱིངས་ལ་སློབ་པས་གང་ལ་བསླབ་པར་འགྱུར།
en: Subhūti then asked, “Blessed Lord, in what will bodhisattva great beings who train in the realm of phenomena become trained?” {Ki.
